index=windows sourcetype=WinEventLog EventCode=4663
| rex field=ObjectName ":[\\/]Users\\(?<username>[^\\]+)\\(?<remaining>.*)"
| where like(remaining, "%ntuser.dat%")
| table _time, host, username, ObjectName, remaining
